Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 远古时期，桃源灵山便非常有名，虽然现在书籍上几乎没有记载，但是有心打听的话还是能知道一些消息的。
en_us: In the ancient times, the Peach Blossom Spirit Mountain (桃源灵山) was very well known. Although nowadays, it's hard to find any information in books, if you ask around enough, there was still some information.

source: 远古时期，通天大陆的修炼者多是得天独厚，他们在同类者比拼，但却看不起柔弱无比的凡人，东洲的修炼者正是延续这种思想，所以修炼者几乎从补踏足凡人镇，不过即使不在凡人镇，修炼者之间的等级分化也十分严重。
en_us: In ancient times, the practitioners of the TongTian Continent thought themselves blessed, they competed amongst themselves and looked down on the frail mortals. The practitioners of Dong Zhou continued with this belief, so practitioners rarely ever set foot in the towns of normal people. The hierarchy amongst practitioners was very strict as well.

source: 远处看着这一幕的游小默惊愕得张大嘴巴，“这是什么情况？”
en_us: You XiaoMo, watching from a distance, felt his jaw drop in shock. "What's this?"

source: 远处，没有参加战圈的唐中华悬立于空中，表情吃惊的看着被追得四处乱窜的游小默，绝佳的视力使得他清楚的看到游小默的脸。
en_us: In the distance, Tang ZhongHua, who had stayed out of the fight, watched You XiaoMo run around with a shocked expression. His powerful eyesight allowed him a clear view of You XiaoMo's face.

source: 远远地，他们就看到两道打得不可开交的身影，两人身上散发出来的强大气势和杀机令他们不敢靠近。
en_us: They could see the two fighting figures from quite a ways away. The powerful aura and killing intent from the two had them afraid to approach.

source: 远远的，游小默就看到站在小港口的两道人影。
en_us: You XiaoMo could see two figures standing at the small harbor from far away.

source: 连刑七都死了，他有怎么可能是男人的对手，竟然还妄想为刑七报仇，真是自不量力！
en_us: Even Xing Qi died. How could he stand up against the man and he even dared to think about revenge, he really overestimated himself! (自不量力)

source: 连续十天，这种现象时不时发生，终于引起一些人的注意。
en_us: This phenomenon happened from time to time for ten consecutive days, and finally attracted some people's attention.

source: 连绵的山峰，陡峭嶙峋，鬼哭崖就在其中，接下来他们要从中找出鬼哭崖。
en_us: The endless mountainpeaks were precipitous and jagged. The Weeping Ghost Shore was in the middle of all of these, so next, they had to find the Weeping Ghost Shore.

source: 迟钝的光团在猛虎体内发威，不仅爆开猛虎的身体，而且反将它的能量吸收了一些，接着就以迅雷不及掩耳之势冲游震天飞了过去。
en_us: The sluggish light ball demonstrated its power inside the fierce tiger's body. Not only did it explode the fierce tiger's body, it also absorbed some of its energy. Then it flew towards You ZhenTian as swiftly as a sudden clap of thunder.

source: 追了一会儿，天恨一群人终于发现他们被耍了，本来还想着对方不熟悉鬼哭涯的地形应该很快就能将他们擒住，结果事实好像跟他们想的出入很大。
en_us: After chasing for a while, Tian Hen and the rest finally discovered that they were being played. They had originally thought that the opponent would be quickly captured since he wasn't familiar with Weeping Ghost Shore's geography, but it turned out that the discrepancy was larger than they had expected.

source: 送走于步，他们没有立刻看玉简里的内容，而是收拾东西回逍遥院，阔别了五六日，游小默的名声比之前更响了，那场战斗的地点毕竟和逍遥院距离不远，大家几乎第一时间就知道了。
en_us: After sending off Yu Bu, they didn't check the contents of the jade drive immediately, but instead packed up to return to XiaoYao Academy. It had been five or six days, and You XiaoMo's name was even more well known. After all, that battle had occurred not far from XiaoYao Academy, so everyone had gotten wind of the event pretty soon.

source: 送走他们，武成立刻跑去找他爹。
en_us: Bidding farewell, Wu Cheng instantly ran to find his dad.

source: 送走叶农，他们关起门研究了下玉简。
en_us: After sending Ye Nong off, they closed the door and studied the jade drive.

source: 适当了一两分钟后，他们终于走动了起来，只不过每一步都十分缓慢。
en_us: After getting used to it for a minute or two, they finally began to move, though each step was very slow.

source: 选手区，原本懒洋洋的看着游小默炼丹的凌霄，眼神突然凌厉了起来，仿佛利刃般朝正在专心炼丹的滕梓心射过去，漆黑的眼眸闪烁着两簇紫色的火焰，片刻间又悄无声息的隐去。
en_us: In the participant’s stands, Ling Xiao, who had been lazily watching You XiaoMo refine pills, turned his suddenly sharp gaze on Teng ZiXin. Purple flames danced within his dark eyes, and then disappeared silently once more.

source: 选拔赛由城主府举办，奖励存放在城主府的金库里，有很多强者重重看守着，连只苍蝇都飞不进去。
en_us: The selection trials were held by the city master and the rewards were stored in the treasury of the city master's mansion. There were so many experts guarding it that not even a fly could get past.

source: 选拔赛的要求非常严格，只有彩级丹师才有资格参加，而且听说是强制性的。
en_us: The requirements of the selection contest were very strict. Only rainbow level mages were eligible to participate and it was said that participation was compulsory.

source: 逍遥院的院生虽然都是但是，但是丹师除了会赚钱，也很烧钱，除了那些真正有些能力有家底的人，大部分人的腰包其实没有多少灵晶，何况这位导师的要求似乎不低。
en_us: The students XiaoYao Institution were all mages. Besides being able to make money easily, mages also spent money very quickly. Most people do not have much spirit gems in their pockets apart from those who truly had some capability and family resources. Besides, this teacher's price was quite high.

source: 透过晶石板确实可以减少吵杂的声响，游小默一直觉得这玩意比现代的高科技还高科技，不过他听说晶石板这种东西在通天大陆并不流行，不是人们排斥，而是这种晶石的量很少。
en_us: Seeing through a tablet did in fact reduce the noise of a typical auction. You XiaoMo had always thought that this stuff was even more high tech then the high tech stuff in the modern world. However, he also heard that this kind of crystal stone tablets were not common in the TongTian Continent, not because it's rejected but because the limited quantity of these crystal stones.

source: 通灵玄龟虽然生活于陆地，但是大海也是他们的领域，在海里他们同样能施展的很开，而人类就不一样了，在海里总归有点束手束脚。
en_us: Though Psychic Black Turtles lived on land, the seas were their forte as well. They could perform equally as well in the sea as they could on land. However it was different for humans/ At sea, it was always a bit more troublesome.

source: 通天大陆许多势力在今天正午的时候将会在他们脚下集中。
en_us: Many fractions in the Tong Tian Continent would gather beneath their feet at noon today.

source: 通天大陆几大势力都集中在乌梅镇外，要是被人看到一定会引起轰动，这里每一个都是跺一跺脚就能让通天大陆震上一震的势力。
en_us: The major powers of TongTian Continent all gathered in Ebony Plum Town. It would definitely cause a stir if they were seen by others, since these were all influencers who could make TongTian Continent shake with one stomp of their foot.

source: 通天大陆永远不缺乏戴面具遮挡容貌的人，就是在乌山集镇也时常出现，但是大多数人还是第一次看到扮相这么极端的人。
en_us: The TongTian Continent weren't void of people who covered their appearances with masks, even in the WuShan Town it was common. However, it was rarely so extreme.

source: 通天殿的丹师大会只有彩级丹师才能参加，是通天帝亲自举办的，不过以前只在通天殿内部举办的，后来才开放到整个大陆，所以即便不是通天殿或逍遥院的院生也可以参加。
en_us: Only Rainbow Level mages could participate in the Mage Assemblage. This event was organized by the TongTian Emperor himself. However, it had only been held within the TongTian Palace before, and was later opened to the whole continent. Therefore, one could participate even if they were not students the TongTian Palace or the XiaoYao Institution.

source: 通灵玄龟可不是青龟或灵龟，作为四灵之一，必定有着与麒麟妖凰龙族一拼的实力。
en_us: The Psychic Black Turtle was not a (青龟) nor a Mystic Tortoise but part of the four (四灵). It's strength must parallel that of the Demon Phoenix Clan and the Dragon Clan.

source: 通灵玄龟是四灵之一，在妖兽中的地位自然尊崇无比，但是像四灵这种帝王兽，基本上不可能与人类签订契约的。
en_us: The Psychic Black Turtle was one of the Four Divine Emperor Beasts, and it naturally had an incredibly respectable position among the demon beasts, but Emperor Beasts such as the Four Divine Emperor Beasts couldn't really form contracts with humans.

source: 通灵玄龟的旁支虽然有很多，但是玄龟族却和麒麟妖凰龙族一样稀少，族中上下所有成员合起来只有几十个，因此他们也非常族中自己的后代，莫景正是因为这些原因，小乌龟是玄龟族，从出生到现在还不到半年，灵智没有完全，要契约是很简单的，所以他担心眼前二人对小乌龟起了异样的心思。
en_us: Although the Psychic Black Turtle had many side families, the Black Turtle Clan (玄龟族) was just as rare as the Qilin, Demon Phoenix, and Dragon Clans. In total, the clan had around several dozen members, and so they greatly valued their descendants. Baby Turtle (小乌龟) was a part of the Black Turtle Clan and was only half a year old. It hadn't even fully gained its Intelligence (灵智) yet, so it would be easy to form a contract with it. Because of these reasons, Mo Jing was worried that the two people in front of him had a similar idea towards the Baby Turtle.

source: 通过亲人血祭，耗费一些精血就可以建立特别的联系方法，只要不是位于不同的位面空间就可以联系，而且距离越短越清晰。
en_us: By using the blood of a family member, (亲人血祭) and some Life Blood/Blood Essence,they could set up a special communication device. As long as they were not of different planes of dimension, they could communicate. Also, the shorter the distance, the clearier the message. (位面空间)

source: 逛了两条街后，游小默拉着凌霄进入一家茶寮。
en_us: After strolling through two streets, You XiaoMo pulled Ling Xiao into a teahouse.

source: 速度非常快，在台下的人几乎只能看到两道残影。
en_us: Their speed was immense. The spectators could more or less see only two blurred afterimages.

source: 遇上这么一个不懂‘规矩’的院生，杨导师想占他便宜是不可能的。
en_us: It was impossible for Teacher Yang to take advantage of such a student that did not understand the 'rules'.

source: 邀请帖不只是一张普通的邀请函，上面还写着参加蜘蛛拍卖会的一些要求，比如他们竟然不以物易物，说是只用灵晶交易，所以想去参加拍卖会就必须先赚些灵晶才行。
en_us: The invite wasn't just a normal invite, there were several requirements for attendance written on it, too. For example, there was no trading items, they only dealed in spirit gems, so if you wanted to attend, you would need to bring an appropriate amount of spirit gems.

source: 邢七会不会再回来他不知道，但他必须离开寻个安全的地方疗伤。
en_us: He didn't know whether Xing Qi would return or not, but he needed to leave and find a safe place to treat his wounds.

source: 邢七惊骇的张了张口，却发现不能说话了。
en_us: In alarm, Xing Qi opened his mouth only to find out that no sounds came out.

source: 邢七愣过之后，突然哈哈大笑起来，“莫景，原来你的依仗不过是一个小丹师，而且还是个人类，我还以为是什么强大的妖兽，既然你这么期待他来救你，那么我就当着你的面把他杀了给你看看。”
en_us: After Xing Qi got over his inital shock, he suddenly bursted into laughter, "Mo Jing, it looks like your 'hope' (依仗) was but a small mage and a human at that. And here I thought they was some powerful demon beast. Since you were so excited that he would save you, then i'll have to kill him right in front of you."

source: 邢七最喜欢欣赏别人临死前的挣扎，反正一个小小的丹师也不可能逃得出他的手掌心，要杀他还不是易如反掌，就好心情的说道：“本大爷就让你说说最后的遗言。”
en_us: Xing Qi loved seeing the the final struggles of someone before thier death and a small small mage wouldn't be able to escape from his clutches anyways. It was easy enough for him to kill, thus with a good mood he said, "Ore-sama (本大爷) will let you speak your last words."

source: 邢七猛然一惊，原以为他在说谎，一股毛骨悚然的感觉却突然袭向四肢百骸，危险的警报快速的响起，可是他却发现他动弹不得了，心中不由得大骇。
en_us: Xing Qi was startled, at first he thought he was lying but soon a shudder of horror (毛骨悚然) creeped up his spine and the alarm in his head went off. However, he soon found himself unable to move, and his heart skipped a beat.

source: 邢七的笑声戛然而止，惊疑不定的朝发出声音的方向看过去，如果有第四个人在这里，他不可能没有发现。
en_us: Xing Qi's laughter stopped abruptly and looked to the source of the sound apprehensively. If there was a fourth person here, he couldn't have not noticed.

source: 邢七警惕的往四周看了看，确实没发现一个人的踪影。
en_us: Xing Qi looked around cautionously and couldn't find anyone.

source: 那一瓶灵酒已经被他们喝掉了一半，剩下一半还是游小默藏起来才没被喝光的。
en_us: They had already drunk half the bottle of spirit wine and the remaining half had been hidden away by You XiaoMo.

source: 那个人就是极有可能是游小默父亲的白衣人，因为白衣人给他的形象实在是和父亲这个词差距太大，于是游小默刻意把他忘记了，说起来……上次和凌霄光溜溜的进入空间，似乎没碰到那个人。
en_us: It was extremely likely that the person in white was You XiaoMo's father, but because the image that the person in white gave him was completely too different from his image of a 'father', You XiaoMo painstakingly forgot him. Speaking of which... last time, when he had entered the dimension naked with Ling Xiao, it seemed that they hadn't come across that person.

source: 那个出卖天心派，出卖老乡的人。
en_us: It was the person who sold out the TianXin Sect and sold out his fellow villagers.

source: 那个最开始提起黑蜘蛛的中年人观察了几秒后立刻否认了。
en_us: The middle aged man that had first brought up the Black Spider disagreed after observing for a few moments.

source: 那个神秘势力据说就坐落在鬼哭涯上面。
en_us: It was rumored that the mysterious fraction was located at the Weeping Ghost Shore (鬼哭涯).

source: 那个神秘势力有一个代号叫做天狗，正是凌霄父亲的亲信在万年前建立的。
en_us: The mysterious force had a code name and it was called Tiangou. This was the force that was established by Ling Xiao's father’s trusted aide thousands of years ago. <strong>t/n: As per Wikipedia, the tiangou (literally: "Heavenly Dog") is a legendary creature from China, resembling a black dog or meteor, which is thought to eat the sun or moon during an eclipse.</strong>

source: 那个臭女人！
en_us: That bitch!

source: 那个阿川一看就知道不是第一次和他们合作。
en_us: That A Chuan clearly was an accomplice, and it wasn't the first time he had done this.

source: 那么，25这个数字应该是一条巨大的分水岭了。
en_us: That meant the number twenty-five was a clear boundary.

source: 那些和游小默一样报了价格的人，也都纷纷赶过来了，其中有一人最引人注意，那是一个肥胖的流油的人。
en_us: Those who had made an offer like You XiaoMo all hurried over. Amongst them, there was one person who was fat to the point of oozing oil that caught the most attention.

source: 那些早已进来的人见他竟然可以动了，纷纷瞪大眼睛露出一副难以置信的表情，他们进来时都差点被压垮，好不容易才能直起身来，他竟然能走动了，不愧是最有希望夺得大赛第一的人之一。
en_us: Those who had come in before showed their disbelief at how quickly he managed to recover his movement capabilities. When they got inside, they had almost been pulled to the ground. It took them a lot of effort to stand straight. Yet, he could already walk. No wonder people thought he was one of the possible victors.

source: 那人像是听到什么好笑的事情，“城主府啊，哪里的城主府，你什么时候去的，我怎么不知道，逃出城主府又是怎么一回事呀？”
en_us: The other seemed like he had just heard something funny. "City Master's estate, huh? Where, when did you go, how come I don't know? And what's this about escaping?"

source: 那人嘴角抽了抽。
en_us: That person's mouth twitched.

source: 那人突然露出一脸邪恶的笑容，“什么叫迁怒，我看这就叫意淫。”
en_us: Suddenly that person revealed a devious smile, "What anger, I say this is just psycholagny." (意淫)

source: 那人立刻站起来，身后拖出一条长长又毛绒绒的尾巴，只见他掀开红色帘子，半人半兽的特征赫然是一只变异的黄鼠兽，身后的尾巴足有两米多长。
en_us: That person instantly stood up, hauling out a long and fluffy tail from behind him. When he threw aside the red curtain, he revealed that his half-human-half-beast appearance was that of an awe-inspiring ground squirrel beast. His tail was at least two meters long.

source: 那人顿时神神秘秘的说道：“知道黑蜘蛛吗？”
en_us: The man suddenly mysteriously whispered, "Do you know of the Black Spider?"

source: 那他为什么还要服用玄龟精血？
en_us: Then why did he still want to ingest the Black Turtle Life Blood?

source: 那位叫麟昊武的少爷虽然没有用一种恨不得将他们扒皮抽筋的眼神看着他们，但是眼睛里却藏着满满的厌恶和不屑。
en_us: While that young master called Lin HaoWu didn't look at them with a gaze that said he wanted to rip their skin off, his eyes were full of disgust and hatred.

source: 那厢，斗篷人被凌霄突袭成功，心中越来越恼火，同事骇然于他的修为，也不知道他是使了什么法子，竟然在这么短时间内就提升三四星，照这个速度下去，再过不了多久，他很可能会赶上主子。
en_us: In the side room, Ling Xiao's surprise attack on the cloaked man was successful, and the cloaked man grew more and more annoyed. At the same time, he was shocked by Ling Xiao's cultivation base. He did not know what method Ling Xiao had used for him to have advanced by three to four stars in such a short time. If he kept up with this speed, Ling Xiao would probably catch up with his Master in a short time.

source: 那名弟子立刻机警的往后退，他的表情甚至没有一丝慌乱，淡定得叫人刮目相看，但是不知道为什么，膝盖突然一痛，然后他就不受控制的跪了下去，再抬头，水妖已经扑过来，再躲闪却来不及了……
en_us: The disciple immediately withdrew while eying it vigilantly. He was not even flustered at all and was so calm that he made one hold him in high esteem. However, for some unknown reason, there was a sudden pain in his knee, and he was unable control himself as he knelt down. When he raised his head again, the water demon had already pounced forward, and it was too late to dodge...

source: 那名强盗立刻兴奋激动的冲着头儿喊道。
en_us: That bandit immediately shouted happily and excitedly at the bandit chief.

source: 那名护卫一脸愤恨与不甘，眼看着对方的刀从他头顶劈下来，他要是死在这里，主子怎么办？
en_us: That

source: 那名死里逃生的弟子瞪大眼睛看着他们，除了震惊，还有一丝愕然，好像认得他们，但又觉得在这里看到他们很不可思议一般。
en_us: The disciple who had barely escaped from death stared at them with shock and a hint of amazement. It was as if he knew them, but thought it was inconceivable to see them here.

source: 那天之后，凌霄就去闭关了。
en_us: After that day, Ling Xiao went to do secluded cultivation.

source: 那天把所有灵草挖出来后，游小默迅速的将它们移植到空间的灵草田里，尽管大部分已经生根发芽，但是距离成熟的时间还是太长了，所以要立刻做好准备。
en_us: After digging out all the magic herbs on that day, You XiaoMo quickly transplanted them into the magic herb fields in his dimension. Even though most of them had taken root and sprouted, immediate preparations had to be made as they would take too long to mature.

source: 那家伙一脸志得意满的朝程荷走过去，仿佛火元素之心已经是他的囊中物一样。
en_us: That fellow walked over to Cheng He with a self-satisfied look, as if he had already gotten the Fire Elemental Essence in his bag.

source: 那座宫殿的家具非常少，当初他在里面转了几圈，结果只看到一套家具，其他地方皆空荡荡的。
en_us: There were very few furnitures in the palace. When he first took a look around, there was only one set of furniture, everywhere else was barren.

source: 那是一个透明，用温玉雕刻四四方方的玉盒子，温玉是上等的好玉，最适合孕养灵物，在里面有一缕像红色的火光在欢快的跳动着，像精灵一样。
en_us: It was a transparent, square-shared jade box made out of warm jade. Warm jade was one of the higher quality top jades (上等的好玉) and it was most suitable for incubating spiritual beings (灵物). Inside was a wisp of red flam that was jumping about energetically like a fairy (精灵).

source: 那是一块只有半丈许的灵草田，稀稀拉拉种植着十几株同一品种的顶级灵草，中间有些坑坑哇哇的地方，不过大家都没在意，全被灵草的长相给吸引了注意力。
en_us: That section was only about two yards wide, and several dozen grade one transcendent level magic herbs were grown, scattered, inside it. There were some bumpy areas in the middle, but nobody paid attention to them. Their attention was all diverted by the appearance of the magic herbs.

source: 那是大通海一处有名的凶险海域，远远就能看到天象变异，一大片海域都被乌云覆盖着，闪电，飓风相互交接，海流越来越湍急，如果有船经过这里，一定会被卷进去。
en_us: It was a famous and dangerous maritime area in DaTong Sea. From a distance, one could see the abnormality of the sky. A large stretch of sea was covered by dark clouds. Lightning and hurricane entwined with each other and the currents were becoming more and more turbulent. If a ship passed by here, it would definitely be sucked in.

source: 那是强者才有的东西！
en_us: Something that only the powerful would have!

source: 那次谈话过后，游小默依言把游君其放了出来，他的本意是让他有多远滚多远，游君其却像块狗皮膏药一样贴上来，怎么撵也撵不走。
en_us: After that conversation, You Xiaomo let You JunQi out based on his words. His intention was to let him scram as far as he could, yet, You JunQi was just as sticky as a dogskin plaster, and would not leave no matter how many times he was peeled off.

source: 那群人不是别人，正是与游小默和凌霄才分别不到半天的莫雪和谢俊一行人，谢俊一开始的目标也是黑色大峡谷，会在这里出现并不意外。
en_us: It was none other than Mo Xue, Xie Jun and co that You XiaoMo and Ling Xiao had left not half a day ago. Xie Jun's original goal had been the Black Canyon, too, so it wasn't unexpected that he'd appear.

source: 那群人来得很快，雷云甚至才刚酝酿好。
en_us: Those people arrived extremely fast. The thunderclouds had just finished brewing. (酝酿?)

source: 那边，玄宗哄了半天，小乌龟就是没反应，好像打定主意不出来了一样，把他给急死了，玄龟族的人都很固执，小乌龟显然也遗传了这一点。
en_us: Over there, Xuan Zong coaxed for quite a while, but the baby turtle didn't respond as if he had made up his mind to not come out. It was worrying Xuan Zong to death. The Black Turtle Clan's people were all extremely obstinate, and it was clear that the baby turtle had also inherited this bit.

source: 那道裂缝看似很容易就能找到，实际上黑蜘蛛的人在谷底找了许久，可是他们却从未发现有这样的裂缝，所以当他们看到被凌霄破坏的地方后，心里其实很吃惊，吃惊过后，自然是立刻钻进去。
en_us: Even though that fissure (裂缝) seemed very easy to find, the Black Spider's people actually searched at the bottom of the canyon for a very long time, yet they had never once discovered that kind of fissure. So after they saw the place that Ling Xiao destroyed, they were extremely shocked in their hearts. After the shock passed, they naturally slipped in immediately.

source: 都这个时候竟然还顾着耍帅！
en_us: Even now you’re still trying to look cool?!

source: 配方上记载的东西他以前就已经买好了，只不过一直没时间酿而已，如今有了时间，他全部都搬了出来。
en_us: He had already bought the items listed on the recipe, it was just that he had no time to brew it. Now that he had time, he moved everything out.

source: 酒楼一如既往的热闹，即使是大白天，也有络绎不绝的客人为了赌博而来的，大堂里坐着不少人，高谈阔论的说着赌博的事情，好不热闹。
en_us: The hotel was as lively as always. Even during the day, there was still a never-ending flow of customers coming to gamble. There wer many people sitting in the lobby, excitedly discussing things about gambling. It was very noisy.

source: 酒楼一片鸦雀无声。
en_us: Silence reigned in the inn.

source: 酒楼位于几条街的中心，交通可谓四通八达，此时却被犹如蚂蚁大军的人群围得水泄不通。
en_us: The hotel was at the center of multiple streets and was accessible from all sides (四通八达). However, it was now being blocked off by the massive crowd, which looked very much liked an ant army.

source: 酒楼的事情发生在大庭广众之下，几乎第一时间便横扫了大半个通天大陆，凌霄是这段时间的风云人物，妖凰族又是四灵之一，两大强强碰撞必定是火花四溅。
en_us: The events at the inn happened before a big crowd, and news of it basically swept threw half of TongTian Continent in an instant. Ling Xiao was the current hero of the day. The Demon Phoenix Clan was one of the Four Ancient Beast Clans, and sparks would definitely fly when two great powers collided.

source: 酒楼的大堂聚集着很多人，一张桌子至少坐着两个人以上，叽叽喳喳的都在讨论这两天封城的事情，似乎没有人知道为什么要封城，很多人在猜测原因。
en_us: Many people were gathered in the lobby of the restaurant and each table had at least two or more people were sitting around it. They were chattering continuously about the closure of the city for these two days. No one seemed to know why the city was sealed and many were trying to guess the reason.

source: 酒楼的客人非常多，大堂几乎坐满了人，众人交头接耳，时不时朝二楼的方向看过去，直到酒楼的老板娘下来才知道为什么。
en_us: The restaurant was packed with customers and the tables at the lobby were nearly completely filled. Everyone was whispering to one another's ear as they periodically looked in the direction of the second floor. It was only until the proprietress came down that You XiaoMo and his group realized the reason for this behavior.

source: 酒楼的生意一向很热闹，此刻大堂里客人却纷纷躲在角落或楼上，空荡荡的大堂只站着五个人。
en_us: The hotel was usually busy all year round, but right now, the guest in the lobby were all hiding upstairs or in the corner. At the empty lobby stood only six people.

source: 酒楼的背景不如双鱼酒楼，此时被找麻烦也没有人出面。
en_us: This hotel's background (背景) wasn't as strong as the ShuangYu Hotel, thus, no one came forward when trouble brewed. (找麻烦也没有人出面)

source: 酒菜没有下药，为了不被他们发现宵夜里有东西，所以他这次来也是为了顺势拿走两碗宵夜的。
en_us: Neither the wine nor the dishes were drugged. So as to make sure he didn't discover the drug, he came with the purpose to also retrieve the evidence.

source: 重力屋刷卡的地方只有一个，所以大家只能一个个来。
en_us: Since there was only one slot to swipe ones card, everyone could only enter the Gravity Room one by one.

source: 重力屋的存在应该已经很久了，可是竟然只有六十四人超过25分钟。
en_us: The Gravity Room had existed for a long time already, yet only sixty four had lasted over twenty-five minutes.

source: 重新坐到床边，银戈双手摸上风迟云的脸颊，凑过去轻轻的吻上他的唇，生涩的吻却牵动了两颗心…
en_us: Returning to his position on the bed, Yin Ge's hands caressed Feng ChiYun's face as he leaned over to give the other a chaste kiss. The clumsy kiss moved two hearts...

source: 金库被盗走了一半之多，里面包括这次选拔赛的奖励，而且连龙血也推动了，再举办选拔赛，没有了奖品只会让赤血家族更丢脸，也难怪游震天会生气，接二连三出事，明显有人在挑衅赤血家族。
en_us: More than half of the vault's contents had been stolen, including the rewards for the qualifications tournament,and even the dragon's blood had been taken. If they held the qualifications tournament without a prize, the ChiXue family would lose even more face.No wonder You ZhenTian was so mad. These problems had cropped up one after the other. C;early, someone was trying to piss off the ChiXue Family.

source: 金翅虫很喜欢停在小乌龟的龟壳上，有时候还会扑腾着翅膀，好像自己在驾乌龟一样。
en_us: The Golden Winged Insect liked to stand on the baby turtle's shell quite a bit, and sdometimes it would even flap its wings as if it were riding the baby turtle.

source: 金翅虫的数量及其稀少，就是在西境也很少见，这种东西就只能在远古才能偶尔看到。
en_us: Golden Winged Insects were beyond rare, even in Xi Jing. This was the kind of thing you could only see in ancient times.

source: 金翅虫飞到龟壳上，像啄木鸟一样开始啃龟壳。
en_us: The Golden Winged Insects flew onto the shell and began to peck at it like woodpeckers.
